Autodesk.AdvanceSteel.ConstructionTypes.AreaObject.Accept(Autodesk.AdvanceSteel.Modelling.IVisitor)
implementation for the visitor pattern
visitor: visitor object

Autodesk.AdvanceSteel.ConstructionTypes.AreaObject.RemoveOpening(Autodesk.AdvanceSteel.ConstructionTypes.OpeningObject)
remove opening object from this area
opening: the opening object to remove
Returns:  true, if the opening was successfully removed

Autodesk.AdvanceSteel.ConstructionTypes.AreaObject.AddOpening(Autodesk.AdvanceSteel.ConstructionTypes.OpeningObject)
add opening to this area
opening: the opening object to add

Autodesk.AdvanceSteel.ConstructionTypes.AreaObject.Openings
list with the openings from this area

Autodesk.AdvanceSteel.ConstructionTypes.AreaObject.#ctor(Autodesk.AdvanceSteel.Geometry.Polyline3d)
creates an AreaObject
contour:  input contour, in WCS, that defines the area